app/Controllers/Client/ClientBaseController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 3
---
    protected function clientCourant(): array
    {
        return $this->clientModel->find(session()->get('client_id'));