app/Controllers/Client/DepotController.php

UPDATE `clients` SET `solde` = 30000
WHERE `clients`.`id` IN (3)
INSERT INTO `operations` (`type_operation_id`, `client_id`, `montant`, `frais`, `solde_avant`, `solde_apres`, `statut`) VALUES (1, 3, 30000, 0, 0, 30000, 'REUSSI')
---
    public function effectuer()
    {
        $montant = (float) $this->request->getPost('montant');

        if ($montant <= 0) {
            return redirect()->back()->withInput()->with('erreur', 'Le montant doit être supérieur à 0.');
        }

        $client = $this->clientCourant();

        $typeOperationModel = new TypeOperationModel();
        $typeDepot           = $typeOperationModel->trouverParCode('DEPOT');

        $fraisCalculator = new FraisCalculator();
        $frais            = $fraisCalculator->calculer($typeDepot['id'], $montant);

        $soldeAvant = (float) $client['solde'];
        $soldeApres = $soldeAvant + $montant - $frais;

        $db = db_connect();
        $db->transStart();

        $this->clientModel->update($client['id'], ['solde' => $soldeApres]);

        $operationModel = new OperationModel();
        $operationModel->insert([
            'type_operation_id' => $typeDepot['id'],
            'client_id'         => $client['id'],
            'montant'           => $montant,
            'frais'             => $frais,
            'solde_avant'       => $soldeAvant,
            'solde_apres'       => $soldeApres,
            'statut'            => 'REUSSI',
        ]);