app/Controllers/AuthController.php

INSERT INTO `clients` (`telephone`, `prefixe_id`, `solde`) VALUES ('0376679644', 5, 0)
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function connecter()
    {
        $telephone = trim((string) $this->request->getPost('telephone'));

        if ($telephone === '' || ! preg_match('/^[0-9]{10}$/', $telephone)) {
            return redirect()->back()->withInput()
                ->with('erreur', 'Numéro de téléphone invalide. Format attendu : 10 chiffres.');
        }

        $prefixeModel = new PrefixeModel();
        $prefixe      = $prefixeModel->trouverParTelephone($telephone);

        if ($prefixe === null) {
            return redirect()->back()->withInput()
                ->with('erreur', "Ce préfixe n'est pas autorisé par l'opérateur.");
        }

        $clientModel = new ClientModel();
        $client      = $clientModel->trouverParTelephone($telephone);

        if ($client === null) {
            $id = $clientModel->insert([
                'telephone'  => $telephone,
                'prefixe_id' => $prefixe['id'],
                'solde'      => 0,
            ], true);

            $client = $clientModel->find($id);