app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0376679644'
 LIMIT 1
---
    public function trouverParTelephone(string $telephone): ?array
    {
        return $this->where('telephone', $telephone)->first();