app/Models/OperationModel.php

SELECT `operations`.*, `types_operation`.`code` as `type_code`, `types_operation`.`libelle` as `type_libelle`
FROM `operations`
JOIN `types_operation` ON `types_operation`.`id` = `operations`.`type_operation_id`
WHERE `operations`.`client_id` = 1
ORDER BY `operations`.`created_at` DESC
---
    public function historiqueClient(int $clientId): array
    {
        return $this->select('operations.*, types_operation.code as type_code, types_operation.libelle as type_libelle')
            ->join('types_operation', 'types_operation.id = operations.type_operation_id')
            ->where('operations.client_id', $clientId)
            ->orderBy('operations.created_at', 'DESC')
            ->findAll();