app/Models/PrefixeModel.php

    public function trouverParTelephone(string $telephone): ?array
    {
        $prefixesActifs = $this->where('actif', 1)->findAll();
---
SELECT *
FROM `prefixes`
WHERE `actif` = 1